caravan2/app/controllers/blogs_controller.rb

  def index
  	@blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def show
  	@blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
  	blog = Blog.new(blog_params)
  	blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "clannad"], ["body", "dango"], ["created_at", "2020-08-25 16:14:53.926366"], ["updated_at", "2020-08-25 16:14:53.926366"]]

  def edit
  	@blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
  	blog = Blog.find(params[:id])
  	blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "category" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["category", ""], ["body", "dangodaikazoku"], ["updated_at", "2020-08-25 15:50:26.962944"], ["id", 1]]

  def destroy
  	blog = Blog.find(params[:id])
  	blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]