sample_app/app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaa"], ["body", ""], ["created_at", "2020-08-21 07:09:34.652971"], ["updated_at", "2020-08-21 07:09:34.652971"]]
---
  def create
  	list = List.new(list_params)
  	list.save

SELECT "lists".* FROM "lists"
---
  def index
  	@lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@list = List.find(params[:id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
  	@list = List.find(params[:id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "dango"], ["updated_at", "2020-08-22 05:26:08.499480"], ["id", 1]]
---
  def update
  	list = List.find(params[:id])
  	list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
  def destroy
  	list = List.find(params[:id])
  	list.destroy